In [1]:
import pandas as pd
import numpy as np

**5.2: Essential Functionality**

*reindex* is an important pandas method, and this changes the order of the index and creates a new object

In [2]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

Sometimes, you may want to fill in values when reindexing, and a method such as *ffill* allows us to do this. *ffill* forward-fills the values

In [4]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [5]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

*reindex* can alter rows, columns, or both. But, when passed only a sequence, it reindexes the rows

In [6]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=["Ohio", "Texas", "California"])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [7]:
frame2 = frame.reindex(index=['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
states = ['Texas', "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

You can also reindex a specific index by using the *axis* keyword

In [9]:
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

You can reindex by using loc, but this only works if all of the new labels already exist in the DataFrame

In [10]:
frame.loc[['a', 'd', 'c'], ['California', 'Texas']]

   California  Texas
a           2      1
d           8      7
c           5      4

Dropping Entries from an Axis

In [11]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrames, index values can be deleted from either axis

In [14]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Calling *drop* with a sequence of labels will drop labels from the row labels, which is axis 0, but you can specify *column* to delete a column

In [15]:
data.drop(index=['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop(columns=['two'])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

You can also delete columns by specifying axis=1 or axis='columns'

In [17]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [18]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

**Index, Selection, and Filtering**

Instead of using integer values for the DataFrame index to access values, you can use the row index values, but if preferred, you can still use integer indexing

In [19]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [20]:
obj['b']

1.0

In [21]:
obj[1]

C:\Users\savin\AppData\Local\Temp\ipykernel_10436\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [22]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [23]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

Even though this method of selecting data works, it is preferred to use the *.loc* operator

In [24]:
obj.loc[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

The reason *loc* is preferred is because regular []-based indexing will treat integers as labels, if the index has integers, so the behavior of using this operation will differ depending on the type of the index

In [25]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

In [26]:
obj1

2    1
0    2
1    3
dtype: int64

In [27]:
obj2

a    1
b    2
c    3
dtype: int64

In [28]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [29]:
obj2[[0, 1, 2]]

C:\Users\savin\AppData\Local\Temp\ipykernel_10436\2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

When using loc, indexing using integers will fail if the index does not contain integers

In [30]:

obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int32')] are in the [index]"

Since *loc* indexes with labels, there is an operation called *iloc* that indexes with integers, whether or not the index contains integers

In [ ]:
obj1

2    1
0    2
1    3
dtype: int64

In [ ]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [ ]:
obj2

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

You can also assign values using this method

In [ ]:
obj2.loc['b':'c'] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [ ]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                                          index=['Ohio', 'Colorado', 'Utah', 'New York'],
                                          columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

Indexing like this has a few special cases, like slicing and selecting data wtih a boolean array

In [ ]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

**Selection on dataframe with *loc* and *iloc***

*loc* is used for *label-based* indexing and *iloc* is used for *integer-based* indexing

In [ ]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.loc['Colorado']

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int32

When you select a single row, it creates a series with an index that contains the DataFrame's column labels. To select multiple rows to create a new DataFrame, pass a sequence of labels or integers

In [ ]:
data.loc[['Ohio', 'Colorado']]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
data.iloc[[0, 1]]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

You can combine both row and column selection in loc by separating the selections with a comma

In [ ]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

You can do similar selections with iloc too

In [ ]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    4    5      6     7

In [ ]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [ ]:
data.iloc[[1,2], [3, 0, 1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

**Integer Indexing Pitfalls**

In [ ]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

Pandas series do not work like other Python Data Structures, in the way that the series cannot guess whether the user wants to use label or integer based indexing

In [ ]:
ser[-1]

KeyError: -1

But, with a noninteger index, there are no complications

In [31]:
ser2 = pd.Series([1, 2, 3], index=['a', 'b', 'c'])
ser2.iloc[-1]

3

**Pitfalls with Chained Indexing**

In [32]:
data.loc[:, 'one'] = 1

In [33]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

**Arithmetic and Data Alignment**

In [34]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [35]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

Adding the two series yields:

In [36]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

There are so many NaN values since adding series' add based on labels, not integers

In [37]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), columns=list("bcd"), index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12).reshape((4, 3)), columns=list("bde"), index=["Utah", 'Ohio', "Texas", 'Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [38]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [39]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

**Arithmetic methods with fill values**

In [40]:
df1 = pd.DataFrame(np.arange(12).reshape((3, 4)), columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20).reshape((4, 5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan

df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [41]:
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

Adding these two dataframes will result in missing values in the places they don't overlap

In [42]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

But, using the add method on df1, and passing an argument to fill_value, this will substitute the NaN values with the chosen value

In [43]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Each arithmetic method has its own counterpart, and these start with the letter r:

In [44]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [45]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

**Operations between DataFrames and Series**

In [47]:
arr = np.arange(12).reshape((3, 4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [48]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [49]:
arr[0]

array([0, 1, 2, 3])

In [50]:
arr - arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

When subtracting arr[0] from arr, the operation is done once to each of the rows. This is called *broadcasting*

In [51]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

series = frame.iloc[0]

In [52]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [53]:
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [54]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

If an index value is not found in the DataFrame's columns or the Series's index, the objects will be reindexed

In [55]:
series2 = pd.Series(np.arange(3), index=list("bef"))
series2

b    0
e    1
f    2
dtype: int32

In [56]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

But, if you want to broadcast over the columns, you have to use one of the arithmetic methods and specify to match over the index

In [57]:
series3=frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [58]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

*.sub* is just the subtraction equivalent of *.add*

In [59]:
frame.sub(series3, axis='index')

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

Function Mapping and Handling

In [60]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list('bde'),
                     index=["Utah", 'Ohio', 'Texas', "Oregon"])

frame

               b         d         e
Utah    0.172250 -0.965464  0.759218
Ohio    0.450501  0.901149  0.092593
Texas  -0.043409 -0.249811  1.624028
Oregon  0.532770 -0.437972  0.163894

*np.abs()* is used to get the absolute value of a value, or in this case, the absolute values of the numbers in a DataFrame

In [61]:
np.abs(frame)

               b         d         e
Utah    0.172250  0.965464  0.759218
Ohio    0.450501  0.901149  0.092593
Texas   0.043409  0.249811  1.624028
Oregon  0.532770  0.437972  0.163894

Another popular operation is to apply a function to one-dimensional arrays to each column or row, which can be achieved using the DataFrame *apply* method

In [62]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    0.576178
d    1.866613
e    1.531435
dtype: float64

Here, the function *f* is use once on each column, and returns the maximum and minimum of each column, but if you pass *axis='columns'*, the function would be used once per row instead

In [63]:
frame.apply(f1, axis='columns')

Utah      1.724681
Ohio      0.808556
Texas     1.873839
Oregon    0.970742
dtype: float64

Also, *apply* can return a Series with multiple values instead of just a scalar value

In [64]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

frame.apply(f2)

            b         d         e
min -0.043409 -0.965464  0.092593
max  0.532770  0.901149  1.624028

Element-wise python functions can also be used, by using *applymap*, but *map* is the more recent version, so that should be used instead

In [65]:
def my_format(x):
    return f"{x:.2f}"

In [68]:
frame.applymap(my_format)

C:\Users\savin\AppData\Local\Temp\ipykernel_10436\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d     e
Utah     0.17  -0.97  0.76
Ohio     0.45   0.90  0.09
Texas   -0.04  -0.25  1.62
Oregon   0.53  -0.44  0.16

In [67]:
frame.map(my_format)

            b      d     e
Utah     0.17  -0.97  0.76
Ohio     0.45   0.90  0.09
Texas   -0.04  -0.25  1.62
Oregon   0.53  -0.44  0.16

**Sorting and Ranking**

In [69]:
obj = pd.Series(np.arange(4), index=['d', 'a', 'b', 'c'])

obj

d    0
a    1
b    2
c    3
dtype: int32

series.sort_index() is used to sort a Series by sorting its index either lexicographically, or by integer values. You can use the *ascending* argument to control whether the order is ascendiong or descending

In [71]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

With a DataFrame, you can sort by index on either axis:

In [72]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=list("dabc"))

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [73]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [74]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

By default, the data is sorted in ascending order, but this can be changed by using the *ascending* argument

In [75]:
frame.sort_index(axis='columns', ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a series by its values, you can use the *sort_values* method

In [76]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

By default, any missing, or NaN values are sorted to the end of the Series

In [77]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

But, you can sort the missing values to the front by using the *na_position* argument:

In [78]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort keys by passing one or more column names to *sort_values*

In [79]:
frame = pd.DataFrame({"b" : [4, 7, -3, 2], "a" : [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

This sorts b ascending, and regardless of the values of the same index of each b value, all columns are reordered to be in the same order

In [80]:
frame.sort_values('b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

To sort by multiple columns, pass a list of names:

In [81]:
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

*Ranking* is when you rank elements in a series or dataframne based on value

In [84]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

Ranks can also be assigned based on the order in which they are observed in the data

In [85]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

You can rank in descending order too

In [87]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

Dataframes can compute rank over the rows or columns

In [88]:
frame = pd.DataFrame({'b' : [4.3, 7, -3, 2], 'a' : [0, 1, 0, 1], 'c' : [-2, 5, 8, -2.5] })
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [89]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

**Axis Indexes with Duplicate Labels**

In [90]:
obj = pd.Series(np.arange(5), index=list('aabbc'))

obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

You can use *is_unique* on the labels to tell if the labels are unique

In [92]:
obj.index.is_unique

False

When you index a label with multiple entries, it will return all entries, and this can make the code very complicated, as the output type from indexing can vary based on whether a label is repeated

In [93]:
obj.a

a    0
a    1
dtype: int32

In [95]:
obj['c']

4

The same thing happens when indexing rows or columns in a dataframe

In [96]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), index=list('aabbc'))
df

          0         1         2
a  1.573744 -0.579681 -1.487539
a  0.649016 -0.256163  0.756356
b -0.508097  0.152958  0.030972
b  0.210598  2.208085 -1.080298
c -0.763255  0.673113 -0.239121

In [97]:
df.loc['b']

          0         1         2
b -0.508097  0.152958  0.030972
b  0.210598  2.208085 -1.080298

In [98]:
df.loc['c']

0   -0.763255
1    0.673113
2   -0.239121
Name: c, dtype: float64